Repository: natbienetre/wordpress-password2cloudflare
Catalog: languages/pass2cf-*.po
Languages: fr_fr

source: Synchronize WordPress password-protected posts with secret environment variables in Cloudflare Pages.
fr_fr: Synchroniser les articles protégés par mot de passe de WordPress avec des variables d'environnement dans Cloudflare Pages.

source: Unknown error (code %1$d): %2$s
fr_fr: Code d'erreur inconnu (code %1$d): %2$s

source: Go to settings
fr_fr: Aller aux paramètres

source: Configuration error: %s
fr_fr: Erreur de configuration: %s

source: Property %s does not exist
fr_fr: La propriété %s n'existe pas

source: You are not authorized to perform this action.
fr_fr: Vous n'êtes pas autorisé à effectuer cette action.

source: No environment variable to delete.
fr_fr: Aucune variable d'environnement à supprimer.

source: %d environment variable deleted.
fr_fr: %d variable d'environnement supprimée.

source: Environment variables synchronized.
fr_fr: Variables d'environnement synchronisées.

source: Environment variables synchronization failed.
fr_fr: Échec de la synchronisation des variables d'environnement.

source: Invalid prefix %s.
fr_fr: Préfixe %s invalide.

source: Error while checking settings: %s
fr_fr: Erreur lors de la vérification des paramètres: %s

source: Settings are valid.
fr_fr: Les paramètres sont valides.

source: Unknown status.
fr_fr: Statut inconnu.

source: Error while deleting environment variables
fr_fr: Erreur lors de la suppression des variables d'environnement

source: Error while synchronizing environment variables
fr_fr: Erreur lors de la synchronisation des variables d'environnement

source: Delete environment variables from Cloudflare project %s
fr_fr: Supprimer les variables d'environment du project Cloudfalre %s

source: Invalid hash algorithm
fr_fr: Algorithme de hash invalid

source: Invalid path encoding method
fr_fr: Méthode d'encodage de chemin invalide

source: Successfully connected to Cloudflare project %s
fr_fr: Connecté avec succès au project Cloudflare %s

# Header for the setting section
source: Synchronization
fr_fr: Synchronisation

# Header for the setting section
source: Dangerous zone
fr_fr: Section dangereuse

# Label for the setting field
source: Environment Variable Prefix
fr_fr: Préfixe de variable d'environnement

# Header for the setting section
source: General
fr_fr: Général

# Label for the setting field
source: Check to enable the plugin
fr_fr: Cochez pour activer le plugin

# Label for the setting field
source: Path encoding method
fr_fr: Méthode d'encodage de chemin

# Label for the setting field
source: Hash algorithm
fr_fr: Algorithme de hash

# Label for the setting field
source: Cloudflare API Key
fr_fr: Clé API Cloudflare

# Label for the setting field
source: Account ID
fr_fr: ID du compte

# Label for the setting field
source: Pages project name
fr_fr: Nom du projet Pages

source: These buttons allow you to reconcile the passwords stored in the database with the environment variables stored in Cloudflare.
fr_fr: Ces boutons vous permettent de réconcilier les mots de passe stockés dans la base de données avec les variables d'environnement stockées dans Cloudflare.

source: These buttons allow you to delete all environment variables from Cloudflare.
fr_fr: Ces boutons vous permettent de supprimer toutes les variables d'environnement de Cloudflare.

# The default prefix for environment variable
source: OLD_PREFIX_
fr_fr: ANCIEN_PREFIXE_

source: These settings define how to synchronize passwords with Cloudflare.
fr_fr: Ces paramètres définissent comment synchroniser les mots de passe avec Cloudflare.

# Represents the method name that does not encode the string
source: Plain
fr_fr: Non encodé

source: These settings are used to interact with the right Cloudflare project.
fr_fr: Ces paramètres sont utilisées pour interagir avec le bon projet Cloudflare.

source: See how to create a Cloudflare API token.
fr_fr: Voir comment créer un jeton d'API Cloudflare.

source: Error while adding environment variable %1$s to Cloudflare project %2$s.
fr_fr: Erreur lors de l'ajout de la variable d'environnement %1$s au projet Cloudflare %2$s.

source: Error while deleting all environment variables (starting with %1$s) from Cloudflare project %2$s
fr_fr: Erreur lors de la suppression de toutes les variables d'environnement (commençant par %1$s) du projet Cloudflare %2$s

source: Failed to synchronize environment variables with the project %s.
fr_fr: Échec de la synchronisation des variables d'environnement avec le projet %s.

source: Synchronize with Cloudflare project %s
fr_fr: Synchroniser avec le projet Cloudflare %s

source: Warning, this will remove all environment variables starting with %s that does not match a protected page.
fr_fr: Attention, cela supprimera toutes les variables d'environnement commençant par %s qui ne correspondent pas à une page protégée.

source: Internal error (code %1$d): %2$s
fr_fr: Erreur interne (code %1$d) : %2$s

source: Please report the bug
fr_fr: Veuillez signaler le bug

source: The token must have the %1$s and %2$s permissions:
fr_fr: Le jeton doit avoir les permissions %1$s et %2$s :

source: Grants access to view Cloudflare Pages projects.
fr_fr: Accorde l'accès à la lecture des projets Cloudflare Pages.

source: Cloudflare Pages Read
fr_fr: Cloudflare Pages Lire

source: Grants access to create, edit and delete Cloudflare Pages projects.
fr_fr: Accorde l'accès à la création, à la modification et à la suppression de projets Cloudflare Pages.

source: Cloudflare Pages Edit
fr_fr: Cloudflare Pages Modifier

source: Security check failed. Please retry.
fr_fr: La vérification de sécurité à échouée. Veuillez réessayer.

source: Error while deleting environment varariable %1$s from Cloudflare project %2$s.
fr_fr: Erreur lors de la suppression de la variable d'environnement %1$s du projet Cloudflare %2$s.

# The text on the button that ensure settings are valid
source: Check the settings
fr_fr: Vérifier les paramètres

source: Settings
fr_fr: Options

# Default prefix for environment variable
source: WP_PASSWORD_
fr_fr: WP_MDP_
